In [1]:
import pandas as pd

In [12]:
data = {
    'Name': ['Alice', 'Bob', None, 'David'],
    'Age': [25, None, 30, 22],
    'Score': [85, 90, None, 88]
}
df_main = pd.DataFrame(data)
display(df_main)

    Name   Age  Score
0  Alice  25.0   85.0
1    Bob   NaN   90.0
2   None  30.0    NaN
3  David  22.0   88.0

How to Use Dropna()

In [ ]:
#df.dropna() → drops rows with any nulls
df = df_main.dropna()
display(df)

    Name   Age  Score
0  Alice  25.0   85.0
3  David  22.0   88.0

In [ ]:
#df.dropna(how='all') → drops rows only if all values are null
df = df_main.dropna(how ='all')
display(df)

    Name   Age  Score
0  Alice  25.0   85.0
1    Bob   NaN   90.0
2   None  30.0    NaN
3  David  22.0   88.0

In [ ]:
#df.dropna(axis=1) → drops columns with any nulls
df = df_main.dropna(axis=1)
display(df)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [ ]:
# df.dropna(subset=['Age', 'Score']) → drops rows where Age or Score is null
df = df_main.dropna(subset=['Age','Score'])
display(df)

    Name   Age  Score
0  Alice  25.0   85.0
3  David  22.0   88.0

Filling Nulls with fillna()

In [ ]:
# A constant (like 0 or "Unknown")
df = df_main.fillna('0')
display(df)

    Name   Age Score
0  Alice  25.0  85.0
1    Bob     0  90.0
2      0  30.0     0
3  David  22.0  88.0

In [ ]:
# A computed value (like mean or median)
df= df_main.copy() #used to copy the df then update the df
df['Age'] = df['Age'].fillna(df['Age'].mean())
display(df)

    Name        Age  Score
0  Alice  25.000000   85.0
1    Bob  25.666667   90.0
2   None  30.000000    NaN
3  David  22.000000   88.0

In [7]:
# Forward fill (propagate last valid value forward)
df = df_main.copy()
df = df.fillna(method='ffill')
display(df)

/tmp/ipykernel_3139/1736315842.py:3: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df = df.fillna(method='ffill')

    Name   Age  Score
0  Alice  25.0   85.0
1    Bob  25.0   90.0
2    Bob  30.0   90.0
3  David  22.0   88.0

In [8]:
# Backward fill (use next valid value)
df = df_main.copy()
df = df.fillna(method='bfill')
display(df)

/tmp/ipykernel_3139/1501320853.py:3: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df = df.fillna(method='bfill')

    Name   Age  Score
0  Alice  25.0   85.0
1    Bob  30.0   90.0
2  David  30.0   88.0
3  David  22.0   88.0

In [9]:
#How would you fill nulls in the 'Score' column with the median of that column?
df = df_main.copy()
df['Score'] = df['Score'].fillna(df['Score'].median())
display(df)

    Name   Age  Score
0  Alice  25.0   85.0
1    Bob   NaN   90.0
2   None  30.0   88.0
3  David  22.0   88.0

#Renaming Columns in Pandas

In [ ]:
df.rename(columns={'Score': 'Test_Score'}, inplace=True)
display(df)

#inplace=True tells pandas to apply the change directly to the original DataFrame — without creating or returning a new one.

    Name   Age  Test_Score
0  Alice  25.0        85.0
1    Bob   NaN        90.0
2   None  30.0        88.0
3  David  22.0        88.0

In [14]:
df = df_main.rename(columns={'Name' : 'Full_Name', 'Age' : 'Years'}, inplace=False)
display(df)
#inplace=true wont return anything while inplace =false will return a new dataframe with the changes

  Full_Name  Years  Score
0     Alice   25.0   85.0
1       Bob    NaN   90.0
2      None   30.0    NaN
3     David   22.0   88.0

# Normalizing Data in Pandas

In [15]:
# Normalize 'Years' column to range [0, 1]
df = df_main.copy()
df['Years_normalized'] = (df['Years'] - df['Years'].min()) / (df['Years'].max() - df['Years'].min())
display(df)

  Full_Name  Years  Score  Years_normalized
0     Alice   25.0   85.0             0.375
1       Bob    NaN   90.0               NaN
2      None   30.0    NaN             1.000
3     David   22.0   88.0             0.000

In [9]:
from sklearn.preprocessing import MinMaxScaler
scaler = MinMaxScaler()
df[['Score']] = scaler.fit_transform(df[['Score']])
display(df)

TypeError: 'NoneType' object is not subscriptable